stevenj/avr-libc3/include/avr/io/attiny25.h
/* Low speed mode */
#define CPU_LSM_CLEAR_gc (0x00) /* Low speed mode - CLEAR */
#define CPU_LSM_SET_gc   (0x80) /* Low speed mode - SET */


/* PCK Enable */
#define CPU_PCKE_CLEAR_gc (0x00) /* PCK Enable - CLEAR */
#define CPU_PCKE_SET_gc   (0x04) /* PCK Enable - SET */


/* PLL Enable */
#define CPU_PLLE_CLEAR_gc (0x00) /* PLL Enable - CLEAR */
#define CPU_PLLE_SET_gc   (0x02) /* PLL Enable - SET */


/* PLL Lock detector */
#define CPU_PLOCK_CLEAR_gc (0x00) /* PLL Lock detector - CLEAR */
#define CPU_PLOCK_SET_gc   (0x01) /* PLL Lock detector - SET */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE      _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB      _SFR_MEM8 (0x0036) /* Input Pins, Port B */
#define PORTBB_DDRB      _SFR_MEM8 (0x0037) /* Data Direction Register, Port B */
#define PORTBB_PORTB     _SFR_MEM8 (0x0038) /* Data Register, Port B */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE          _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_ADCSRB        _SFR_MEM8 (0x0023) /* ADC Control and Status Register B */
#define AC_ACSR          _SFR_MEM8 (0x0028) /* Analog Comparator Control And Status Register */
#define AC_DIDR0         _SFR_MEM8 (0x0034) 

/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE         _SFR_MEM8 (0x0000) /* ADC Base Address */
#define ADC_ADCSRB       _SFR_MEM8 (0x0023) /* ADC Control and Status Register B */
#define ADC_ADC          _SFR_MEM16(0x0024) /* ADC Data Register  Bytes */
#define ADC_ADCL         _SFR_MEM8 (0x0024) /* ADC Data Register  Bytes LOW BYTE */
#define ADC_ADCH         _SFR_MEM8 (0x0025) /* ADC Data Register  Bytes HIGH BYTE */
#define ADC_ADCSRA       _SFR_MEM8 (0x0026) /* The ADC Control and Status register */
#define ADC_ADMUX        _SFR_MEM8 (0x0027) /* The ADC multiplexer Selection Register */
#define ADC_DIDR0        _SFR_MEM8 (0x0034) /* Digital Input Disable Register 0 */

/* USI - Universal Serial Interface (0x0000) */
#define USI_BASE         _SFR_MEM8 (0x0000) /* USI Base Address */
#define USI_USICR        _SFR_MEM8 (0x002D) /* USI Control Register */
#define USI_USISR        _SFR_MEM8 (0x002E) /* USI Status Register */
#define USI_USIDR        _SFR_MEM8 (0x002F) /* USI Data Register */
#define USI_USIBR        _SFR_MEM8 (0x0030) /* USI Buffer Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE       _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK      _SFR_MEM8 (0x0035) /* Pin Change Enable Mask */
#define EXINT_MCUCR      _SFR_MEM8 (0x0055) /* MCU Control Register */
#define EXINT_GIFR       _SFR_MEM8 (0x005A) /* General Interrupt Flag register */
#define EXINT_GIMSK      _SFR_MEM8 (0x005B) /* General Interrupt Mask Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE      _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR      _SFR_MEM8 (0x003C) /* EEPROM Control Register */
#define EEPROM_EEDR      _SFR_MEM8 (0x003D) /* EEPROM Data Register */
#define EEPROM_EEAR      _SFR_MEM16(0x003E) /* EEPROM Address Register  Bytes */
#define EEPROM_EEARL     _SFR_MEM8 (0x003E) /* EEPROM Address Register  Bytes LOW BYTE */
#define EEPROM_EEARH     _SFR_MEM8 (0x003F) /* EEPROM Address Register  Bytes HIGH BYTE */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE         _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCR        _SFR_MEM8 (0x0041) /* Watchdog Timer Control Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE         _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_OCR0B        _SFR_MEM8 (0x0048) /* Timer/Counter0 Output Compare Register */
#define TC8_OCR0A        _SFR_MEM8 (0x0049) /* Timer/Counter0 Output Compare Register */
#define TC8_TCCR0A       _SFR_MEM8 (0x004A) /* Timer/Counter  Control Register A */
#define TC8_GTCCR        _SFR_MEM8 (0x004C) /* General Timer/Counter Control Register */
#define TC8_TCNT0        _SFR_MEM8 (0x0052) /* Timer/Counter0 */
#define TC8_TCCR0B       _SFR_MEM8 (0x0053) /* Timer/Counter Control Register B */
#define TC8_TIFR         _SFR_MEM8 (0x0058) /* Timer/Counter0 Interrupt Flag register */
#define TC8_TIMSK        _SFR_MEM8 (0x0059) /* Timer/Counter Interrupt Mask Register */

/* TC1 - Timer/Counter, 8-bit (0x0000) */
/* TC8_BASE ALREADY DEFINED */
#define TC8_DTPS         _SFR_MEM8 (0x0043) /* Dead time prescaler register */
#define TC8_DT1B         _SFR_MEM8 (0x0044) /* Dead time value B */
#define TC8_DT1A         _SFR_MEM8 (0x0045) /* Dead time value register */
#define TC8_OCR1B        _SFR_MEM8 (0x004B) /* Output Compare Register */
/* TC8_GTCCR ALREADY DEFINED */
#define TC8_OCR1C        _SFR_MEM8 (0x004D) /* Output compare register */
#define TC8_OCR1A        _SFR_MEM8 (0x004E) /* Output Compare Register */
#define TC8_TCNT1        _SFR_MEM8 (0x004F) /* Timer/Counter Register */
#define TC8_TCCR1        _SFR_MEM8 (0x0050) /* Timer/Counter Control Register */
/* TC8_TIFR ALREADY DEFINED */
/* TC8_TIMSK ALREADY DEFINED */

/* BOOT_LOAD - Bootloader (0x0000) */
#define BOOT_LOAD_BASE   _SFR_MEM8 (0x0000) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR _SFR_MEM8 (0x0057) /* Store Program Memory Control Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE         _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_GPIOR0       _SFR_MEM8 (0x0031) /* General purpose register 0 */
#define CPU_GPIOR1       _SFR_MEM8 (0x0032) /* General Purpose register 1 */
#define CPU_GPIOR2       _SFR_MEM8 (0x0033) /* General Purpose IO register 2 */
#define CPU_PRR          _SFR_MEM8 (0x0040) /* Power Reduction Register */
#define CPU_DWDR         _SFR_MEM8 (0x0042) /* debugWire data register */
#define CPU_CLKPR        _SFR_MEM8 (0x0046) /* Clock Prescale Register */
#define CPU_PLLCSR       _SFR_MEM8 (0x0047) /* PLL Control and status register */
#define CPU_OSCCAL       _SFR_MEM8 (0x0051) /* Oscillator Calibration Register */
#define CPU_MCUSR        _SFR_MEM8 (0x0054) /* MCU Status register */
#define CPU_MCUCR        _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SPL          _SFR_MEM8 (0x005D) /* Stack Pointer Low Byte */
#define CPU_SREG         _SFR_MEM8 (0x005F) /* Status Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE        _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW         _SFR_MEM8 (0x0000) 
#define FUSE_HIGH        _SFR_MEM8 (0x0001) 
#define FUSE_EXTENDED    _SFR_MEM8 (0x0002) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE     _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT  _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

